#!/usr/bin/env python3
# -*- coding: utf-8 -*-
import math

print("1 + 1 =", 1 + 1)
print("3 - 1 =", 3 - 1)
print("3 * 2 =", 3 * 2)
# 除法会自动转换成浮点数
print("20 / 5 =", 20 / 5)
print("23 / 5 =", 23 / 5)
print("23 / 3 =", 23 / 3)
# 地板除，结果向下取整
print("23 // 5 =", 23 // 5)
print("23 // 5.0 =", 23 // 5.0)
print("-23 // 5 =", -23 // 5)
print("-23 // 5.0 =", 23 // 5.0)
# 浮点数的运算结果还是浮点数
print("1 + 1.0 =", 1 + 1.0)
print("3 - 1.0 =", 3 - 1.0)
print("3 * 2.0 =", 3 * 2.0)
# 取模运算
print("7 % 3 =", 7 % 3)
# 幂运算
print("2 ** 4 =", 2 ** 4)
print("math.pow(2, 4) =", math.pow(2, 4))

print("------------------------------这是一条分割线------------------------------")

print("2e3:", 2e3)
print("2.3e3:", 2.3e3)
print("2.3333333e3:", 2.3333333e3)

print("------------------------------这是一条分割线------------------------------")

# 复数，复数的实部a和虚部b都是浮点型
print("1 + 1j:", 1 + 1j)
print("complex(1, 1):", complex(1, 1))
